In [35]:
import pandas as pd
import numpy as np
reserve_tb = pd.read_csv("../awesomebook/data/reserve.csv")

In [5]:
result = reserve_tb.groupby('hotel_id').agg({'reserve_id':'count','customer_id':'nunique'})
result.reset_index(inplace=True)
result.columns = ['hotel_id','rsv_cnt','cus_cnt']

In [13]:
result = reserve_tb.groupby(['hotel_id','people_num'])['total_price'].sum().reset_index()
result.columns = ['hotel_id','people_num','price_sum']

In [14]:
result

     hotel_id  people_num  price_sum
0         h_1           1     156600
1         h_1           2     156600
2         h_1           3     391500
3         h_1           4     417600
4        h_10           1      11200
...       ...         ...        ...
1154     h_98           3     793800
1155     h_98           4     453600
1156     h_99           1     179200
1157     h_99           2     448000
1158     h_99           4    1164800

[1159 rows x 3 columns]

In [15]:
result = reserve_tb.groupby('hotel_id').agg({'total_price':['max','min','mean','median',lambda x:np.percentile(x,q=20)]}).reset_index()
result.columns = ['hotel_id','price_max','price_min','price_mean','price_median','price_20per']

In [16]:
result

    hotel_id  price_max  price_min     price_mean  price_median  price_20per
0        h_1     208800      26100  112230.000000        104400        73080
1       h_10      67200      11200   42933.333333         50400        26880
2      h_100      57600       4800   27600.000000         28800         9600
3      h_101     168000      14000   75764.705882         56000        30800
4      h_102      72000      12000   32769.230769         24000        18000
..       ...        ...        ...            ...           ...          ...
295     h_95     518400      43200  275815.384615        259200       146880
296     h_96      66600       7400   33015.384615         29600        17760
297     h_97     250800      20900   83600.000000         62700        20900
298     h_98     226800      18900   96723.529412         75600        56700
299     h_99     268800      44800  128000.000000         89600        67200

[300 rows x 6 columns]

In [24]:
result = reserve_tb.groupby('hotel_id').agg({'total_price':['var','std']}).reset_index()
result.columns = ['hotel_id','price_var','price_std']
result.fillna(value = {'price_var':0,'price_std':0},inplace=True)

In [25]:
result

    hotel_id     price_var      price_std
0        h_1  3.186549e+09   56449.526127
1       h_10  8.258133e+08   28736.968061
2      h_100  3.198316e+08   17883.835689
3      h_101  2.402441e+09   49014.703676
4      h_102  3.576923e+08   18912.755159
..       ...           ...            ...
295     h_95  3.313772e+10  182037.696857
296     h_96  3.159231e+08   17774.225072
297     h_97  5.474685e+09   73991.116584
298     h_98  3.432893e+09   58590.896578
299     h_99  5.745428e+09   75798.599541

[300 rows x 3 columns]

In [26]:
reserve_tb['total_price'].round(-3).mode()

0    10000
1    20000
2    40000
dtype: int64

In [30]:
reserve_tb['reserve_datetime'] = pd.to_datetime(reserve_tb['reserve_datetime'],format='%Y-%m-%d ')

In [33]:
reserve_tb['log_no']  = reserve_tb.groupby('customer_id')['reserve_datetime'].rank(ascending=True,method = 'first')

In [38]:
rsv_cnt_tb = reserve_tb.groupby('hotel_id').size().reset_index()
rsv_cnt_tb.columns = ['hotel_id','rsv_cnt']

In [40]:
rsv_cnt_tb['rsv_cnt_rank'] = rsv_cnt_tb['rsv_cnt'].rank(ascending=False,method='min')
rsv_cnt_tb.drop('rsv_cnt',axis = 1,inplace=True)